//var arrMoonCake = Array(


var arrKrathong = Array(
  [0, 'กระทง#1'],
  [1, 'กระทง#2'],
  [2, 'กระทง#3'],
  [3, 'กระทง#4'],
  [4, 'กระทง#5'],
  [5, 'กระทง#6'],
  [6, 'กระทง#7'],
  [7, 'กระทง#8'],
  [8, 'กระทง#9']
);

var arrTextMemo = Array(
  [0, 'ดอกบัว', 'ขอให้ข้าพเจ้าพบแต่ความสำเร็จในชีวิต ทั้งด้านการงานและครอบครัว ตลอดปีด้วยเถิด'],
  [1, 'ดอกจำปี', 'ขอให้ข้าพเจ้าร่ำรวย เงินถุงเงินถัง ล่ำซำไม่ขัดสน เงินปังๆ ตลอดปีด้วยเถิด'],
  [2, 'กุหลาบ', 'ขอให้ข้าพเจ้ามีความรักสมหวัง ไม่มีอุปสรรคขวางกั้นในทุกเรื่องด้วยเถอะ'],
  [3, 'ดาวเรือง', 'ขอให้ข้าพเจ้ามีโชคด้านการงาน ทำมาค้าขึ้น เจ้านายรัก ลูกน้องเชื่อฟัง ปังทุกเรื่องด้วยเถิด'],
  [4, 'กล้วยไม้', 'ขอให้สุขภาพแข็งแรงทั้งกายและใจ ไร้โรคภัย หมดทุกข์หมดโศกด้วยเถิด'],
  [5, 'บานไม่รู้โรย', 'ขอให้ข้าพเจ้ามีแต่ความรักหวาน ความรักที่ยาวนาน ไม่มีจืดจางด้วยเถิด'],
  [6, 'ดอกเข็ม', 'ขอให้ข้าพเจ้ามีสติปัญญา การเรียน การงานผ่านฉลุยด้วยเถิด'],
  [7, 'ดอกพุด', 'ขอให้ข้าพเจ้ามีแต่ความเจริญ ความมั่นคง มีใจที่บริสุทธิ์ และเป็นที่รักของคนที่พบเห็นด้วยเถิด'],
  [8, 'ดอกมะลิ', 'ขอให้ข้าพเจ้าพบแต่บุคคลที่มีความปรารถนาดี และเป็นที่รักของคนที่พบเห็นด้วยเถิด']
);

var arrPerson = Array(
  [0, 'ชาย#1'],
  [1, 'ชาย#2'],
  [2, 'ชาย#3'],
  [3, 'ชาย#4'],
  [4, 'หญิง#1'],
  [5, 'หญิง#2'],
  [6, 'หญิง#3'],
  [7, 'หญิง#4'],
  [8, 'หญิง#5']
);

var arrMap = Array(
  [0, 'map-0.jpg'],
  [1, 'map-1.jpg'],
  [2, 'map-2.jpg'],
  [3, 'map-3.jpg'],
  [4, 'map-4.jpg'],
  [5, 'map-5.jpg'],
  [6, 'map-6.jpg']
);

/*

⭐ ดอกบัว  ความสำเร็จในชีวิต
⭐ ดอกจำปี การเงินปัง ตลอดปี
⭐ ดอกกุหลาบ ให้ความรักสมหวัง
⭐ ดอกดาวเรือง การงาน การเงิน
⭐ ดอกกล้วยไม้ สุขภาพแข็งแรง ไม่มีโรค
⭐ ดอกบานไม่รู้โรย  ความรักที่ยาวนาน
⭐ ดอกเข็ม การเรียน การงานผ่านฉลุย
⭐ ดอกพุด ...
⭐ ดอกมะลิ ...


*/
//
//var arrLocation = ['สนญ.','ประชาอุทิศ','จันทน์','บางกอกน้อย','สมุทรปราการ','นนทบุรี'];
//var arrLocationE = ['loy-1','loy-2','loy-3','loy-4','fai-fah-samuthprakarn','fai-fah-nonthaburi'];
//var arrInterest = ['ศิลปะ','กีฬา','ดนตรีและ<br>การแสดง','ภาษา','ครัว ขนม<br>และเบเกอรี่','การออกแบบ<br>สิ่งทอ','การออกแบบ<br>อุตสาหกรรม','ท่องเที่ยวเพื่อ<br>ชุมชนยั่งยืน'];
//var arrInterestE = ['art','sport','drama','language','cook','carft','industry','travel'];


function Connect_DB() {
  var firebaseConfig = {
    apiKey: "AIzaSyDfTJJ425U4OY0xac6jdhtSxDeuJ-OF-lE",
    authDomain: "retailproject-6f4fc.firebaseapp.com",
    projectId: "retailproject-6f4fc",
    databaseURL: "https://file-upload-6f4fc.firebaseio.com",
    storageBucket: "retailproject-6f4fc.appspot.com",
    messagingSenderId: "653667385625",
    appId: "1:653667385625:web:a5aed08500de80839f0588",
    measurementId: "G-9SKTRHHSW9"
  };
  firebase.initializeApp(firebaseConfig);
}
